import BlockHeader from "../../components/blockHeader/BlockHeader";
import Layout from "../../components/layout/Layout";
import TableComponent from "../../components/tableComponent/TableComponent";
import Tabs from "../../components/tabs/Tabs";
import "./request.scss";

const Request = () => {
  const headers = [
    "Номер",
    "Дата",
    "Время",
    "Пункт отправления",
    "Статус",
    "Водитель",
    "Сумма клиента",
    "Сумма водителя",
    "Заказчик",
  ];
  const body = [
    {
      items: [
        "НФ-301940",
        "02.04.22",
        "14:30",
        "г.Оренбург, ул Салмышская д36",
        "Выполнен",
        "Юрий Иванов",
        "30 000 руб",
        "25 000 руб",
        "ООО Альбатрос",
      ],
    },
    {
      items: [
        "НФ-301940",
        "02.04.22",
        "14:30",
        "г.Оренбург, ул Салмышская д36",
        "Срочно",
        "Юрий Иванов",
        "30 000 руб",
        "25 000 руб",
        "ООО Альбатрос",
      ],
    },
    {
      items: [
        "НФ-301940",
        "02.04.22",
        "14:30",
        "г.Оренбург, ул Салмышская д36",
        "Выполнен",
        "Юрий Иванов",
        "30 000 руб",
        "25 000 руб",
        "ООО Альбатрос",
      ],
    },
    {
      items: [
        "НФ-301940",
        "02.04.22",
        "14:30",
        "г.Оренбург, ул Салмышская д36",
        "В процессе",
        "Юрий Иванов",
        "30 000 руб",
        "25 000 руб",
        "ООО Альбатрос",
      ],
    },
    {
      items: [
        "НФ-301940",
        "02.04.22",
        "14:30",
        "г.Оренбург, ул Салмышская д36",
        "В процессе",
        "Юрий Иванов",
        "30 000 руб",
        "25 000 руб",
        "ООО Альбатрос",
      ],
    },
    {
      items: [
        "НФ-301940",
        "02.04.22",
        "14:30",
        "г.Оренбург, ул Салмышская д36",
        "Срочно",
        "Юрий Иванов",
        "30 000 руб",
        "25 000 руб",
        "ООО Альбатрос",
      ],
    },
    {
      items: [
        "НФ-301940",
        "02.04.22",
        "14:30",
        "г.Оренбург, ул Салмышская д36",
        "В процессе",
        "Юрий Иванов",
        "30 000 руб",
        "25 000 руб",
        "ООО Альбатрос",
      ],
    },
    {
      items: [
        "НФ-301940",
        "02.04.22",
        "14:30",
        "г.Оренбург, ул Салмышская д36",
        "Выполнен",
        "Юрий Иванов",
        "30 000 руб",
        "25 000 руб",
        "ООО Альбатрос",
      ],
    },
  ];

  return (
    <>
      <Tabs />
      <div className="requests-wrap">
        <BlockHeader />
        <TableComponent headers={headers} body={body} />
      </div>
    </>
  );
};

export default Request;
